# Stage06: Cleaning Data

### importing libraries

In [1]:
import os
import sys
from pathlib import Path 
import numpy as np
import pandas as pd
import os
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.preprocessing import MinMaxScaler, StandardScaler

### importing cleaning

In [2]:
clean_path = Path.cwd().parent / "src"
sys.path.append(str(clean_path))
from cleaning import *

### creating demo data set and saving it in /data/raw

In [3]:
df_demo = pd.DataFrame({
        'numeric_col': [10, None, 40, 55, 70],
        'category_col': ['A', 'B', 'A', 'B', 'C'],
        'price': ['$100', '$200', '$150', None, '$250'],
        'date_str': ['2025-08-01','2025-08-02',None,'2025-08-04','2025-08-05'],
        'category': ['Electronics','Furniture','Toys','Clothing',None]
    })

raw_path = Path.cwd().parent / "data" / "raw"
sys.path.append(str(raw_path))

In [4]:
df_demo.to_csv(f'{str(raw_path)}/raw.csv')

In [5]:
df=pd.read_csv((f'{str(raw_path)}/raw.csv'))

### Applying cleaning

In [6]:
df['price_float']=df['price']
df['price_float']=df['price_float'].str.replace('$','').astype(float)

In [7]:
df

,Unnamed: 0,numeric_col,category_col,price,date_str,category,price_float
0,0,10.0,A,$100,2025-08-01,Electronics,100.0
1,1,NaN,B,$200,2025-08-02,Furniture,200.0
2,2,40.0,A,$150,NaN,Toys,150.0
3,3,55.0,B,NaN,2025-08-04,Clothing,NaN
4,4,70.0,C,$250,2025-08-05,NaN,250.0

In [8]:
df= fill_missing_median(df,'price_float')
# df= normalize_data(df)
df

,Unnamed: 0,numeric_col,category_col,price,date_str,category,price_float,price_float_missing
0,0,10.0,A,$100,2025-08-01,Electronics,100.0,100.0
1,1,NaN,B,$200,2025-08-02,Furniture,200.0,200.0
2,2,40.0,A,$150,NaN,Toys,150.0,150.0
3,3,55.0,B,NaN,2025-08-04,Clothing,NaN,175.0
4,4,70.0,C,$250,2025-08-05,NaN,250.0,250.0

In [10]:
df= normalize_data(df,'price_float_missing')
df

,Unnamed: 0,numeric_col,category_col,price,date_str,category,price_float,price_float_missing,price_float_missing_scaled
0,0,10.0,A,$100,2025-08-01,Electronics,100.0,100.0,0.000000
1,1,NaN,B,$200,2025-08-02,Furniture,200.0,200.0,0.666667
2,2,40.0,A,$150,NaN,Toys,150.0,150.0,0.333333
3,3,55.0,B,NaN,2025-08-04,Clothing,NaN,175.0,0.500000
4,4,70.0,C,$250,2025-08-05,NaN,250.0,250.0,1.000000

In [11]:
df=drop_missing(df)
df

,Unnamed: 0,numeric_col,category_col,price,date_str,category,price_float,price_float_missing,price_float_missing_scaled
0,0,10.0,A,$100,2025-08-01,Electronics,100.0,100.0,0.0

In [12]:
raw_path = Path.cwd().parent / "data" / "processed"
sys.path.append(str(raw_path))
df_demo.to_csv(f'{str(raw_path)}/processed.csv')